What is pandas ?

pandas is an open source python library that contains data structures and tools for dealing with data (http://pandas.pydata.org/).

Why pandas ?

pandas is very intuitive and used a dataframe theme to handle data.
A bit like excel spreadsheet, but many, many times more powerful ad flexible.

Which dataset are we doing ?

The Titanic dataset which consists of details of the majority of passengers who travelled on RMS Titanic.

"The sinking of the RMS Titanic is one of the most infamous shipwrecks in history.  On April 15, 1912, during her maiden voyage, the Titanic sank after colliding with an iceberg, killing 1502 out of 2224 passengers and crew. This sensational tragedy shocked the international community and led to better safety regulations for ships.

One of the reasons that the shipwreck led to such loss of life was that there were not enough lifeboats for the passengers and crew. Although there was some element of luck involved in surviving the sinking, some groups of people were more likely to survive than others, such as women, children, and the upper-class"



source: kaggle.com

In [ ]:
import pandas as pd
#import seaborn as sns

%matplotlib inline

In [6]:
??pd.read_csv

In [8]:
# Read in the titanic dataset as a pandas dataframe. Change path_to_file to where the fule is stored in your laptop

my_df = pd.read_csv("path_to_file/Titanic.csv")

# Find out dimensions of the dataframe
my_df.shape

(891, 12)

In [ ]:
#Different file types that can be read in (demo), sql, tables, json, etc.
pd.

In [9]:
# Look at top five rows of the dataframe

my_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [10]:
my_df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [11]:
# Look at last five rows of our dataframe

my_df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [12]:
#Select any column/s by column name
my_df[["Name","Fare"]].head()

                                                Name     Fare
0                            Braund, Mr. Owen Harris   7.2500
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  71.2833
2                             Heikkinen, Miss. Laina   7.9250
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  53.1000
4                           Allen, Mr. William Henry   8.0500

In [ ]:
my_df.columns

In [ ]:
#Select any column by integer position
my_df.iloc[0:3,5:7]

In [13]:
#Select any row by integer position
my_df[0:3]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [15]:
# Select specific rows that match a given condition

select_df = my_df[my_df["Sex"] == "male"]
select_df.shape
#select_df.tail()

(577, 12)

In [17]:
my_df["Sex"].unique()

array(['male', 'female'], dtype=object)

In [ ]:
# How to sort a dataframe

sorted_df = my_df.sort_values(by = ["Name","Age"],inplace = False)
sorted_df.head()

In [ ]:
# How to transpose a dataframe

my_df_T = my_df.T
my_df_T.head()

In [ ]:
my_df_T.shape

# Drill Time !

For each question, you can type in the response below it i.e.open up a new code cell below it and write code there !

From this dataset, how many passengers were male ?

From this dataset, how many passengers were female ?

How many male passengers survived the sinking ? (0 = No, 1 = Yes)

How many female passengers survived the sinking ?

How many people above age 25 were in the ship at the time of sinking ?

How many females below age 50 survived the sinking ?

How many people who travelled Pclass 1 survived ?

How many people who travelled Pclass 3 survived ?

Can you make a dataframe of all passengers sorted by their age ?

How many people below age 20 survived the sinking ?